Revit 2025 API
RebarBendData Constructor
Overload List
Name | Description
RebarBendData() |  Constructs a new RebarBendData with default settings.
RebarBendData(RebarBarType, RebarHookType, RebarHookType, RebarStyle, RebarHookOrientation, RebarHookOrientation) |  Constructs a new RebarBendData using the bar type, hook types, style and orientation values.
Top
See Also
Reference
RebarBendData Class
Autodesk.Revit.DB.Structure Namespace